{
  "_class_name": "Ideogram4Pipeline",
  "_diffusers_version": "0.39.0.dev0",
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "Qwen3VLModel"
  ],
  "tokenizer": [
    "transformers",
    "Qwen2Tokenizer"
  ],
  "transformer": [
    "diffusers",
    "Ideogram4Transformer2DModel"
  ],
  "unconditional_transformer": [
    "diffusers",
    "Ideogram4Transformer2DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLFlux2"
  ]
}
